app/controllers/session_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'rameshsencha7@gmail.com' LIMIT 1
---
  def create
  	unless params[:user][:email].blank?

INSERT INTO `users` (`created_at`, `email`, `updated_at`, `user_first_name`, `user_id`, `user_last_name`, `user_middle_name`, `user_type`) VALUES ('2013-08-06 12:28:10', 'rameshsencha7@gmail.com', '2013-08-06 12:28:10', 'Ramesh', NULL, 'Sencha', '', NULL)
INSERT INTO `user_passes` (`created_at`, `current_pass`, `current_salt`, `pass1`, `pass2`, `pass3`, `updated_at`, `user_id`) VALUES ('2013-08-06 15:19:58', '19d177b2aeedc5b5a1945538de882eb7c9d2a515dcdd1ced55402873d5c2185a', 'f6ffd85574ab6b9c15d5bee5ee07df2219eaaddf8b6c41be62f0bdc857713826', NULL, NULL, NULL, '2013-08-06 15:19:58', 20130806)
INSERT INTO `contact_infos` (`address1`, `address2`, `contact_no`, `created_at`, `updated_at`, `user_id`) VALUES ('test', 'test', 1111111111, '2013-08-06 15:19:58', '2013-08-06 15:19:58', 20130806)
---
  def create_user
  	@user = User.new(params[:user])
  	if @user.valid?
		ActiveRecord::Base.transaction do
		  @user.user_id = generate_user_id
		  @user.user_type = '0'
		  @user.save!
	  	  @user.create_user_pass!(password: params[:user][:password], user_id: @user.user_id)
	  	  contact_param = {address1: params[:user][:address1], address2: params[:user][:address2], contact_no: params[:user][:contact_no], user_id: @user.user_id}
	  	  @user.create_contact_info!(contact_param)